############################################################################################################################
###### answer.R -- 2017/07/23データに対してラン検定を行う ##################################################################
############################################################################################################################



#### ライブラリーの読み込み ####
library(tidyverse)
library(tseries)

#### データの読み込み ####
# 2017年度の解析用データセット
df2017 <- read_rds("analysis_df_2017.rds")

#### データの整形 ####
## 1. substr関数でlabelを切り分け(2017-07-23)、mutate関数で後方に追加 ##
x <- df2017 %>% mutate(date = substr(label, 1, 10))

## 2. filter関数で、列date == "2017-07-23"の部分のみ抽出  ##
x_fil <- x %>% filter(date == "2017-07-23")

## 3. mutate関数で列`全学電力量`(東キャンパス+西キャンパス)を追加 ##
x_add <- x_fil %>% mutate(`全学電力量` = `東ｷｬﾝﾊﾟｽ受電電力量　　　　　　　` + `西ｷｬﾝﾊﾟｽ受電電力量　　　　　　　`)

## 4. select関数で列label, `全学電力量`を選択
x_sel <- x_add %>% select(label, 全学電力量)

## 5. median関数で全学電力量の中央値medを求める
med <- median(x_sel$全学電力量)

## 6. ifelse関数でカテゴリ分け（中央値以上：A, 中央値未満：B）
x_cat <- x_sel %>% mutate(category = ifelse(test = x_sel$全学電力量 >= med, yes = "A", no = "B"))

### ランダムネス検定 ######################################################################################################
# 統計検定量st BAの順
t <- c(21, 31-21, 33-31, 35-33, 36-35, 48-36)
st <- length(t)

# Bの個数n1
n1 <- sum(t[1], t[3], t[5])
# Aの個数n2
n2 <- sum(t[2], t[4], t[6])

# 連による検定の数表より行えないので、runs.test関数を使う
result <- runs.test(factor(x_cat$category), alternative = "two.sided")

##########################################################################################################################
### P値(result$p.value) < 0.05 となり、時系列データはランダムであるという仮説は棄却 ###############################
#################################### よって、この時系列データはランダムではない ##########################################

#### 結果の出力 ####
# ワーキングディレクトリ
wd <- getwd()

# 保存ディレクトリの設定
setwd("answer_07_23/") 

# データの保存
write_excel_csv(x_cat, "dataset.csv")

# 解析結果の保存
save(list = ls(), file = "all.Rdata")

# 元のディレクトリに戻す
setwd(wd)


